---
kind: type
id: T:Autodesk.Revit.DB.Electrical.AnalyticalPowerSourceData
source: html/844cf629-c023-47a8-55f1-b1d702780658.htm
---
# Autodesk.Revit.DB.Electrical.AnalyticalPowerSourceData

Represents the data and parameters of analytical power source node.

## Syntax (C#)
```csharp
public class AnalyticalPowerSourceData : AnalyticalDistributionNodePropertyData
```